{
  "display-name": "PaperBanana",
  "description": "Automating Academic Illustration For AI Scientists",
  "value-1": "Value #1",
  "editor-1": "Editor #1",
  "generate-1": "Generate #1",
  "editor": "Editor",
  "modifies-existing-images-based-on-text-instructions-using-ai-pow": "Modifies existing images based on text instructions using AI-powered editing capabilities.",
  "url-of-the-source-image-to-edit-must-be-a-valid-uri-pointing-to": "URL of the source image to edit. Must be a valid URI pointing to an accessible image file.",
  "text-instructions-describing-the-desired-edits-specify-changes-a": "Text instructions describing the desired edits. Specify changes, additions, or modifications to apply.",
  "output-image-aspect-ratio-options-range-from-ultrawide-21-9-to-p": "Output image aspect ratio. Options range from ultrawide (21:9) to portrait (9:16). Default is 3:2.",
  "output-resolution-quality-1k-standard-2k-high-or-4k-ultra-high-d": "Output resolution quality. 1K (standard), 2K (high), or 4K (ultra-high). Default is 1K.",
  "url-of-the-edited-image-points-to-the-modified-image-file-with-a": "URL of the edited image. Points to the modified image file with applied changes.",
  "planner": "Planner",
  "translates-research-content-into-detailed-visual-prompts-using-i": "Translates research content into detailed visual prompts using in-context learning from reference diagrams.",
  "research-method-or-scientific-content-to-be-illustrated-accepts": "Research method or scientific content to be illustrated. Accepts detailed text describing mechanisms, processes, or findings.",
  "optional-title-or-caption-for-the-illustration-provides-context": "Optional title or caption for the illustration. Provides context for visual intent.",
  "optional-array-of-reference-objects-from-retriever-each-contains": "Optional array of reference objects from retriever. Each contains id, visual_intent, content, and path_to_gt_image for in-context learning.",
  "generated-detailed-prompt-for-image-visualization-contains-compr": "Generated detailed prompt for image visualization. Contains comprehensive visual description based on content and references.",
  "array-of-reference-image-urls-extracted-from-references-used-as": "Array of reference image URLs extracted from references. Used as visual examples for downstream generation.",
  "retriever": "Retriever",
  "searches-curated-diagram-collection-to-find-visually-similar-ref": "Searches curated diagram collection to find visually similar references for guiding illustration generation.",
  "research-content-or-method-description-to-find-relevant-referenc": "Research content or method description to find relevant reference diagrams for. Supports detailed scientific text.",
  "optional-caption-providing-additional-context-for-retrieval-help": "Optional caption providing additional context for retrieval. Helps narrow down visual intent matching.",
  "array-of-matched-reference-objects-each-contains-id-unique-ident": "Array of matched reference objects. Each contains id (unique identifier), visual_intent (diagram type), content (description), and path_to_gt_image (image path).",
  "visualizer": "Visualizer",
  "generates-scientific-illustrations-from-text-prompts-using-state": "Generates scientific illustrations from text prompts using state-of-the-art image generation models.",
  "detailed-text-description-of-the-image-to-generate-should-includ": "Detailed text description of the image to generate. Should include visual elements, layout, style, and scientific details.",
  "optional-array-of-reference-image-urls-for-style-guidance-helps": "Optional array of reference image URLs for style guidance. Helps maintain visual consistency with existing diagrams.",
  "url-of-the-generated-image-points-to-the-newly-created-illustrat": "URL of the generated image. Points to the newly created illustration based on the prompt.",
  "generate": "Generate Diagram",
  "end-to-end-academic-illustration-pipeline-retrieves-references-p": "retrieves references, plans visual layout, and generates publication-ready diagrams.",
  "research-content-or-method-description-to-illustrate-required-in": "Research content or method description to illustrate. Required input that drives the entire generation pipeline. Should contain scientific mechanisms, processes, or findings.",
  "optional-title-or-caption-providing-context-passed-to-retriever": "Optional title or caption providing context. Passed to retriever and planner for better visual intent matching.",
  "url-of-the-final-generated-academic-illustration-output-from-the": "URL of the final generated academic illustration. Output from the visualize node after the complete pipeline execution."
}
